using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using BGU.DRPL.SignificantOwnership.Core.Spares.Dict;
using System.ComponentModel;
using Evolvex.Utility.Core.ComponentModelEx;
using BGU.DRPL.SignificantOwnership.Core.Spares.Data;

namespace BGU.DRPL.SignificantOwnership.Core.Questionnaires
{
    /// <summary>
    /// АНКЕТА членів виконавчого органу та наглядової (спостережної) ради юридичної особи
    /// Додаток 3 до Положення про порядок реєстрації та ліцензування банків, відкриття відокремлених підрозділів
    /// file                                  : f364524n1223.doc
    /// Рівень складності                     : 9
    /// (оціночний, шкала від 1 до 10)
    /// Пріоритетність                        : Hi  (Легенда: Hi - Висока, Lo - Низька, Mid - Середня, Hold - Поки що притримати)
    /// Подавач анкети                        : LP (Легенда: LP - юр.особа, PP - фіз.особа, BK - банк)
    /// Чи заповнюватиметься он-лайн          : Так
    /// Первинну розробку структури завершено : Ні
    /// Структуру фіналізовано                : Ні
    /// (=остаточно узгоджено 
    /// з бізнес-користувачами)
    /// </summary>
    public class RegLicAppx3MemberCandidateAppl : IQuestionnaire
    {
        /// <summary>
        /// Стосовно участі в ___________________________________________________________________
        /// (повне офіційне найменування банку)
        /// ___________________________________________________________________________________
        /// (найменування юридичної особи)
        /// </summary>
        public BankInfo BankRef { get; set; }
        
        /// <summary>
        /// 1. Інформація про особу
        /// 1.1. _______________________________________________________________________________.
        ///         (прізвище, ім'я, по батькові, посада в юридичній особі)
        /// 1.2. Паспортні дані _________________________________________________________________.
        ///   (серія, номер, дата видачі, ким виданий)
        /// 1.3. Громадянство __________________________________________________________________.
        /// (країна, дата прийняття громадянства, якщо воно змінювалося)
        /// 1.4. Адреса постійного місця проживання ______________________________________________.
        /// 1.5. Реєстраційний номер облікової картки платника податків або серія та номер паспорта (для фізичних осіб, які через свої релігійні переконання відмовляються від прийняття реєстраційного
        /// номера облікової картки платника податків та повідомили про це відповідний контролюючий орган і мають відмітку у  паспорті) __________________________________________________________________________________.
        /// </summary>
        [DisplayName("Кандидат")]
        [Description("Реквізити фізособи-кандидата на посаду...")]
        [Required]
        public GenericPersonID Candidate { get; set; }
        
        /// <summary>
        /// 1.6. Займані посади за останні п'ять років _______________________________________________
        /// ___________________________________________________________________________________
        /// (найменування юридичної особи, найменування посади;  період перебування на посаді з _____ до _____;
        /// __________________________________________________________________________________.
        /// причина звільнення; якщо трудовий стаж переривався, то слід зазначити причину)
        /// </summary>
        public List<EmploymentRecordInfo> Last5YrsWorkExperience {get;set;}

        /// <summary>
        /// 1.7. Останнє місце роботи, номер телефону роботодавця _________________________________.
        /// </summary>
        [DisplayName("Місце роботи")]
        [Description("9. Місце роботи і посада на дату заповнення анкети ")]
        [Required]
        public EmploymentRecordInfo LastEmploymentRecord { get; set; }

        /// <summary>
        /// 1.8. Освіта та професійна кваліфікація _________________________________________________
        ///                                        (науковий ступінь,
        /// __________________________________________________________________________________.
        /// професійна ліцензія, номер, дата видачі диплома, ким виданий, спеціальність і кваліфікація)
        /// </summary>
        [Required]
        public List<EducationRecordInfo> Education { get; set; }
        
        /// <summary>
        /// Поле необов'язкове - якщо є професійні ліцензії
        /// Покриває п.1.8 (у частині проф.ліцензій)
        /// </summary>
        public List<ProfessionLicenseInfo> ProfessionalLicenses {get;set;}

        public bool IsAppyingForSignificantOwnership {get;set;}
        /// <summary>
        /// 1.9. Розмір участі в юридичній особі, яка має намір набути або збільшити істотну участь у банку-емітенті,*
        /// ___________________________________________________________________.
        /// 
        /// * Заповнюється власниками істотної участі в банку або особами, які мають намір набути істотну участь у банку.
        /// </summary>
        public List<OwnershipStructure> OwnershipStakeWithLPAcquiree {get;set;}
        /// <summary>
        /// 1.10. Розмір отриманих  доходів за останній звітний період (рік)*  
        /// __________________________________________________________________________________.
        /// 
        /// * Заповнюється власниками істотної участі в банку або особами, які мають намір набути істотну участь у банку.
        /// </summary>
        public CurrencyAmount LastYearIncome {get;set;}


        /// <summary>
        // 2. Відносини власності з банком-емітентом
        // 2.1. Чи є Ви учасником банку-емітента? _______________________________________________:
        // (так, ні)
        /// </summary>
        public bool IsIssuerBankStakeholder { get; set; }

        /// <summary>
        // а) пряме володіння - ____ відсотків статутного капіталу банку, що  становить ________________ 
        //                                                                                (кількість)
        // акцій (паїв),  загальною номінальною вартістю ______________ гривень;
        /// </summary>
        public SharesAcquisitionInfo DirectOwnershipWithBankSummary { get; set; }

        // б) опосередковане володіння - ______ відсотків через _______________________
        // __________________________________________________________________________________.
        // (найменування учасника банку та розмір його прямого володіння в банку)

        // 2.2. Чи маєте Ви (як фізична особа) намір збільшити частку в статутному капіталі банку-емітента? _________________________________________________________________________.
        // 2.3. Чи є Ви пов'язаною з банком-емітентом особою? ____________________________________
        //                                                                                                                                                                                          (тип пов'язаності

        // __________________________________________________________________________________.
        //                                                 зазначається відповідно до статті 52 Закону України "Про банки і банківську діяльність")

        // 3. Інші питання

        // 3.1. Чи притягувалися Ви до кримінальної відповідальності? ______________________________
        // __________________________________________________________________________________.
        // (якщо так, то зазначити де і коли, за якою статтею/статтями Кримінального кодексу України)

        // 3.2. Чи маєте Ви судимість не погашену,  не зняту в установленому законодавством порядку? 
        // ___________________________________________________________________________________
        // __________________________________________________________________________________.
        // (якщо так, то зазначити детальну інформацію)

        //3.3. Чи притягувалися Ви до відповідальності за порушення антимонопольного, податкового, банківського, валютного законодавства, правил діяльності на ринку цінних паперів тощо? _____
        // __________________________________________________________________________________.
        // (коли вчинено порушення, зміст порушення, які накладені санкції)

        // 3.4. Чи маєте Ви невиконані майнові (фінансові) зобов'язання  перед іншими особами? 
        // ___________________________________________________________________________________
        // (якщо так, то зазначити, які саме зобов'язання,

        //___________________________________________________________________________________
        //                                                              у якому розмірі, перед якою особою та з яких причин не були виконані,
        // __________________________________________________________________________________.
        //                                                               а також подальші плани щодо виконання/невиконання цих зобов'язань)

 
        //3.5. Стверджую, що я належним чином виконую вимоги законодавства України з питань запобігання та протидії легалізації (відмиванню) доходів, одержаних злочинним шляхом, або фінансуванню тероризму.

        //Я, ________________________________________________________________________________,
        //                                                                                                    (прізвище, ім'я, по батькові)

        //стверджую, що інформація, надана в анкеті, є правдивою і повною, та не заперечую проти перевірки Національним банком України достовірності поданих документів і персональних даних, що в них містяться.

        //У разі будь-яких змін в інформації, що зазначена в цій анкеті, зобов'язуюся повідомити про них Національний банк України протягом 10-ти днів з дня їх виникнення.

        //_______________________
        //(дата підписання анкети)	_____________________
        //(підпис фізичної особи,
        //засвідчений нотаріально)	_______________________
        //(ініціали та прізвище
        //фізичної особи
        //друкованими літерами)



        public string SuggestSaveAsFileName()
        {
            throw new NotImplementedException();
        }
    }
}
