using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using BGU.DRPL.SignificantOwnership.Core.Spares.Dict;
using Evolvex.Utility.Core.ComponentModelEx;
using BGU.DRPL.SignificantOwnership.Core.Spares.Data;
using System.ComponentModel;

namespace BGU.DRPL.SignificantOwnership.Core.Questionnaires
{
    /// <summary>
    /// АНКЕТА юридичної особи (у тому числі банку)
    /// Додаток 2 до Положення про порядок реєстрації та ліцензування банків, відкриття відокремлених підрозділів
    /// file                                  : f364524n1227.doc
    /// Рівень складності                     : 10
    /// (оціночний, шкала від 1 до 10)
    /// Пріоритетність                        : Hi  (Легенда: Hi - Висока, Lo - Низька, Mid - Середня, Hold - Поки що притримати)
    /// Подавач анкети                        : LP (Легенда: LP - юр.особа, PP - фіз.особа, BK - банк)
    /// Чи заповнюватиметься он-лайн          : Так
    /// Первинну розробку структури завершено : Ні
    /// Структуру фіналізовано                : Ні
    /// (=остаточно узгоджено 
    /// з бізнес-користувачами)
    /// </summary>
    [System.ComponentModel.Editor(typeof(BGU.DRPL.SignificantOwnership.Core.TypeEditors.RegLicAppx2OwnershipAcqRequestLP_Editor), typeof(System.Drawing.Design.UITypeEditor))]
    public class RegLicAppx2OwnershipAcqRequestLP : IQuestionnaire
    {

        /// стосовно участі в ___________________________________
        /// (повне офіційне найменування банку)
        [Required]
        public BankInfo BankRef { get; set; }
        /// 
        /// 1. Інформація про юридичну особу
        /// 
        /// 1.1. ____________________________________________________________________________.
        ///                                                                                                          (найменування юридичної особи)
        /// 
        /// 1.2. ____________________________________________________________________________.
        ///                                                                                                       (місцезнаходження юридичної особи)
        /// 
        /// 1.3. Код за ЄДРПОУ _____________________________________________________________.
        /// 1.4. Код платника податків ________________________________________________________.
        [DisplayName("Юр.особа-заявник")]
        [Description("1. Інформація про юридичну особу")]
        [Required]
        public GenericPersonID Acquiree { get; set; }
        /// 1.5. Рейтингова оцінка ____________________________________________________________.
        ///                                                                    (за рейтингом, який підтверджений у бюлетені, однієї  з провідних рейтингових компаній IBCA,
        ///                                                                                                                         Standart & Poor's, Moode's)

        public CreditRatingInfo CreditRatingGrade { get; set; }
        /// 1.6. Основний вид діяльності юридичної особи _______________________________________.
        public string AcquireeCoreActivity { get; set; }
        /// 1.7. Повні  офіційні  найменування банків,  у яких юридична особа має рахунки (не заповнюється банками), __________________________________________________________.
        public List<BankInfo> AccountsWithBanks { get; set; }
        /// 1.8. Повні  офіційні найменування банків,  які надають інформацію про стан рахунків юридичної особи, з яких має здійснюватися  оплата за акції/паї (не заповнюється банками), ________________________________________________________________________________
        /// _______________________________________________________________________________.
        public List<BankInfo> AccountsWithBanksToBePaidFrom { get; set; }
        /// 1.9. Голова та  члени наглядової (спостережної) ради юридичної  особи _______________________________________________________________________________.
        ///                                                                                           (прізвища, імена, по батькові)
        public bool IsSupervisoryCouncilPresent { get; set; }
        public CouncilBodyInfo SupervisoryCouncil { get; set; }
        /// 
        /// 1.10. Голова та члени виконавчого органу юридичної особи ____________________________
        /// _______________________________________________________________________________.
        ///                                                                                            (прізвища, імена, по батькові)
        /// 
        public bool IsExecutivesPresent { get; set; }
        public CouncilBodyInfo Executives { get; set; }
        
        /// 1.11. Державний орган, що здійснює контроль (нагляд) за діяльністю юридичної особи, _______________________________________________________________________________.
        ///                                                                                                (найменування органу)
        public FinancialOversightAuthorityInfo StateRegulatorAuthority { get; set; } //todo

        /// 1.12. Державний  орган,  який здійснив реєстрацію юридичної особи  (для іноземців), _______________________________________________________________________________.
        ///  (найменування органу, країна місцезнаходження)
        /// - див. MentionedIdentities
        //todo

        /// 2. Відносини з банком-емітентом
        /// 
        /// 2.1. Найменування, номер і дата офіційного видання, у якому опубліковано оголошення про емісію (у разі первинного розміщення), _____________________________________________.
        public bool IsIPO { get; set; }
        public PublicationInfo IPOPublication { get; set; }
        /// 2.2. Андеррайтер (за наявності) ____________________________________________________.
        ///                                   (найменування, код за ЄДРПОУ)
        public GenericPersonID Underwriter { get; set; }
        /// 2.3. Наявна участь у банку:
        /// а) пряме володіння - _______ відсотків статутного капіталу банку  в розмірі _______ гривень, що становить __________ акцій (паїв), загальною номінальною вартістю _________ гривень;
        ///                                            (кількість)
        public SharesAcquisitionInfo ExistingDirectOwnershipWithBankSummary { get; set; } //todo - check type
        /// б) опосередковане володіння - _____ відсотків 
        public SharesAcquisitionInfo ExistingImplicitOwnershipWithBankSummary { get; set; } //todo - check type
        /// б) опосередковане володіння - _____ відсотків у розподілі голосів  
        /// через _______________________________________________________________________________.
        ///       (найменування учасника (учасників) банку та розмір його (їх) володіння в банку)
        /// --------------
        /// Розшифровка ExistingDirectOwnershipWithBankSummary і ExistingImplicitOwnershipWithBankSummary
        public List<OwnershipStructure> ExistingOwnershipWithBankDetails { get; set; }
        /// 2.4. Наміри щодо набуття/збільшення істотної участі в банку:
        /// а) пряме володіння - _______ відсотків статутного капіталу банку в розмірі _______ гривень, що становить ________ акцій (паїв), загальною номінальною вартістю ___________ гривень;
        ///                                       (кількість)
        public SharesAcquisitionInfo AppliedForDirectOwnershipSummary { get; set; } //todo - check type
        /// б) опосередковане володіння - _____ відсотків у розподілі голосів  через* _______________________________________________________________________________.
        ///                                (найменування учасника (учасників) банку та розмір його (їх) володіння в банку)
        public SharesAcquisitionInfo AppliedForImplicitOwnershipSummary { get; set; } //todo - check type
        /// б) опосередковане володіння - у розподілі голосів  через* _______________________________________________________________________________.
        ///                                (найменування учасника (учасників) банку та розмір його (їх) володіння в банку)
        /// ---------------------
        /// Розшифровка AppliedForImplicitOwnershipSummary
        public List<OwnershipStructure> AppliedForOwnershipDetails { get; set; }
        /// 2.5. Майбутня   істотна  участь  з  урахуванням  кількості  акцій  (паїв), які  юридична  особа  має  намір  придбати,   становитиме  _______________ відсотків  статутного  капіталу  банку  в розмірі  __________________________ гривень і складатиметься із:
        /// а) прямого володіння в розмірі ___ відсотків статутного  капіталу  банку в сумі ____ гривень, що становитиме ________ акцій (паїв), загальною номінальною вартістю _________ гривень;
        ///                                                (кількість)
        public SharesAcquisitionInfo TargetedDirectOwnershipSummary { get; set; } //todo - check type
        /// б) опосередкованого володіння - ___ відсотків у розподілі голосів  через _______________________________________________________________________________.
        ///                             (найменування учасника (учасників) банку та розмір його (їх) володіння в банку)
        public SharesAcquisitionInfo TargetedImplicitOwnershipSummary { get; set; } //todo - check type
        /// _______________
        /// * Заповнюється власниками істотної участі  в  банку  особами, які мають намір набути істотну участь у банку.
        /// ------------------
        /// Розшифровка TargetedImplicitOwnershipSummary 
        public List<OwnershipStructure> TargetedOwnershipDetails { get; set; }

        /// 3. Інформація про оплату
        /// 
        /// 3.1. Кількість  акцій,  які  юридична  особа  має намір придбати,  ___ одиниць, номінальна вартість однієї акції (паю) ____ гривень,  загальна сума ________ гривень, фактична вартість придбаних акцій  (паїв) ___________ гривень, у тому числі кількість акцій з правом  голосу _______________________________________________________________________________.
        public SharesAcquisitionInfo SharesToBeBought { get; set; }

        /// <summary>
        /// 3.2. Джерела  походження коштів юридичної особи,  за рахунок 
        /// яких  здійснюється сплата за акції (паї), ____________________________.
        ///                                     (прибуток, резервний капітал тощо)
        /// </summary>
        [Required]
        public List<IncomeOriginInfo> FundsOrigin { get; set; }

        /// 3.3. Терміни сплати ______________________________________________________________.
        ///                      (одноразово, частинами, із зазначенням терміну, протягом якого здійснюватиметься сплата)
        public List<PaymentDeadlineInfo> PaymentDeadLines { get; set; }
        
        ///  
        /// 3.4. Інформація   про   кредити,   одержані  юридичною  особою  в  банку-емітенті, ________________________________________________________________________________
        ///                                                     (номер і дата договору про надання кредиту, сума кредиту, термін
        /// _______________________________________________________________________________.
        ///                                              погашення кредиту, сума заборгованості за договором на дату подання анкети)
        public List<LoanInfo> LoansWithIssuingBank { get; set; }
        
        /// 3.5. Інформація про кредити, що одержані юридичною особою в інших  банках (не заповнюється банками), ___________________________________________________________
        ///                                                                                                    (номер і дата договору про надання кредиту, сума
        /// 
        /// _______________________________________________________________________________.
        ///                                         кредиту, строк погашення кредиту, сума заборгованості  за договором на дату подання анкети)
        /// 3.6. Інформація  про  стан  виконання зобов'язань щодо повернення  кредитів, одержаних у банках, _________________________________________________________________________
        ///                                                                              (згідно з умовами договору або з порушенням умов договору.
        /// 
        /// ________________________________________________________________________________
        ///                              Якщо порушено умови договору, то зазначити номер договору, суму, строки, які умови порушені, 
        ///                                                             причини, залишок заборгованості на день заповнення анкети)
        /// 
        public List<LoanInfo> LoansWithOtherBank { get; set; }
        /// 4. Відносини власності юридичної особи із суб'єктами господарювання, 
        /// у тому числі іншими банками (крім банку, у який планується
        /// здійснення інвестиції)
        /// 4.1. Найменування юридичної особи, код за ЄДРПОУ _________________________________
        /// _______________________________________________________________________________.
        /// 4.2. Місцезнаходження ___________________________________________________________.
        /// 4.3. Основний вид діяльності юридичної особи _______________________________________.
        /// 4.4. Відсоток власності в юридичній особі ___________________________________________.
        public List<OwnershipStructure> AcquireeOwnershipOtherThanBankRef { get; set; }
        /// 4.5. Чи  є  працівники  або  довірена  особа  юридичної  особи  в наглядовому органі цієї юридичної особи? _______________________________________________________________.
        public List<CouncilBodyInfo> AssociatedPersonsInOtherCouncils { get; set; }
        /// 4.6. Чи представляє юридична особа інтереси інших суб'єктів господарювання? 
        ///  _______________________________________________________________________________.
        ///         (якщо так, то зазначити, якого саме, з яких питань)
        // див. PersonsLinks
        
        /// 4.7. Перелік  банків,  у яких юридична особа є власником істотної  участі або 
        /// афілійованою особою, ________________________________________________________________________.
        ///                          (зазначити конкретно, якою особою, у якому банку)
        public List<BankInfo> AssociatedOrOwnerWithBanks { get; set; }

        /// 5. Загальна інформація
        /// 
        /// 5.1. Власники істотної участі в юридичній особі:
        /// юридична особа _________________________________________________________________
        ///                                                                                                (найменування, код за ЄДРПОУ,
        /// _______________________________________________________________________________;
        ///                                                                                                місцезнаходження, відсоток участі)
        /// 
        /// фізична особа ___________________________________________________________________
        ///                                                                                          [прізвище, ім'я, по батькові, паспортні дані,
        /// 
        /// _______________________________________________________________________________.
        ///                                        реєстраційний номер облікової картки платника податків або серія та номер паспорта
        ///                           (для фізичних осіб, які через свої релігійні переконання відмовляються  від прийняття реєстраційного
        ///                                номера облікової картки платника  податків та повідомили про це відповідний контролюючий орган 
        /// і мають відмітку у паспорті),  відсоток участі]
        public List<OwnershipStructure> AcquireeOwners { get; set; }

        /// 6. Інші питання
        /// (крім банків)
        /// 
        /// 6.1. Чи порушувалася справа про банкрутство юридичної особи? _______________________.
        public bool HadBankruptcyInvestigation { get; set; } //todo - question
        public List<BankruptcyInvestigationInfo> BankruptcyInvestigations { get; set; }

        /// 6.2. Чи  має   юридична  особа  невиконані  майнові  (фінансові)  зобов'язання перед іншими особами? _______________________________________________________________________
        [Required]
        public bool HasMiscNonRepaidDebts { get; set; }

        /// ________________________________________________________________________________
        ///                                                                  (якщо так, то зазначити, які саме зобов'язання, у якому розмірі,
        /// 
        /// _______________________________________________________________________________.
        ///                                              перед якою особою та з яких причин не були виконані, а також подальші плани
        ///                                                                         щодо виконання/невиконання цих зобов'язань)
        /// 
        [Required]
        public List<IndebtnessInfo> MiscNonRepaidDebts { get; set; }

        /// 6.3. Чи  притягувалася  юридична  особа  до  відповідальності  за  порушення антимонопольного,  податкового, банківського, валютного  законодавства, правил діяльності на ринку цінних паперів тощо?
        [Required]
        public bool HadIndustrySpecificBreaches { get; set; }

        /// ________________________________________________________________________________
        ///                                                           (зазначити, коли вчинено порушення, зміст порушення, накладені санкції)
        /// 
        /// _______________________________________________________________________________.
        /// 
        public List<BreachOfLawRecordInfo> BreachesOfLaw { get; set; }

        /// 6.4. Чи була юридична особа протягом останнього року, що передував прийняттю рішення про ліквідацію юридичної особи,  
        /// власником істотної участі (10 і більше відсотків) у цій особі? 
        [Required]
        public bool HasLiquidatedSignOwnershipLastYear { get; set; }

        /// __________________________________________________________________________
        ///                                                                                                (найменування юридичної особи,
        /// 
        /// _______________________________________________________________________________.
        ///                                код за ЄДРПОУ, відсоток володіння в ній, докладна інформація про причини та підстави ліквідації)
        /// 
        /// 
        public List<LiquidatedEntityOwnershipInfo> LiquidatedSignOwnershipLastYear { get; set; }

        /// 6.5. Стверджую, що юридична особа належним чином виконує вимоги законодавства України з питань запобігання та протидії легалізації (відмиванню) доходів, одержаних злочинним шляхом, або фінансуванню тероризму та до юридичної особи (або власників істотної участі в юридичній особі) не застосовувалися міжнародні санкції.
        [Required]
        public bool IsMoneyLaunderingEtcLawsKept { get; set; }

        /// Стверджую, що юридична особа має можливість підтвердити походження джерел коштів, за рахунок яких придбає акції банку.
        /// 
        [Required]
        public bool CanProveMoneyOrigins { get; set; }
        /// Стверджую, що інформація, надана в анкеті, є правдивою і повною, та не заперечую проти перевірки Національним банком України достовірності поданих документів і персональних даних, що в них містяться.
        /// 
        [DisplayName("Підтверджую правдивість інформації?")]
        [Description("Я, (прізвище, ім'я, по батькові) стверджую, що інформація,  надана в анкеті,\n є правдивою і повною, та не заперечую проти перевірки Національним банком України достовірності поданих документів і персональних даних, що в них містяться.\n")]
        [Editor(typeof(BGU.DRPL.SignificantOwnership.Core.TypeEditors.BooleanEditor), typeof(System.Drawing.Design.UITypeEditor))]
        [Required]
        public bool IsApplicationInfoAccurateAndTrue { get; set; }

        /// У разі будь-яких змін в інформації, що зазначена в цій анкеті,  зобов'язуюся повідомити про них Національний банк України  протягом 10-ти днів з дня їх виникнення.
        /// 
        [DisplayName("Зобов'язуюсь повідомляти про зміни?")]
        [Description("У разі будь-яких змін в інформації, що зазначена в цій анкеті, зобов'язуюся повідомити про них Національний банк України протягом 10-ти днів з дня їх виникнення.")]
        [Editor(typeof(BGU.DRPL.SignificantOwnership.Core.TypeEditors.BooleanEditor), typeof(System.Drawing.Design.UITypeEditor))]
        [Required]
        public bool AmObligingToKeepUp2DateWithin10Days { get; set; }

        /// _________________________
        /// (посада керівника юридичної
        /// особи - заявника, який підписав анкету
        /// і відповідальний за інформацію,
        /// що наведена в ній)
        /// 
        /// (підпис керівника)
        /// 
        /// 
        /// М.П.
        /// 
        /// (ініціали та прізвище
        /// керівника
        /// друкованими літерами)
        /// 
        /// 
        /// Підписано ______________________
        ///                                           (число, місяць, рік)
        [DisplayName("Підписант")]
        [Description("Відомості по особу, що підписала анкету")]
        [Required]
        public SignatoryInfo Signatory { get; set; }
        
        /// 
        /// Прізвище, ім'я, по батькові контактної особи ___________________.
        /// 
        /// Номер телефону та факсу ________________________________________.
        [DisplayName("Контакти")]
        [Description("Контактні дані відправника анкети")]
        [Required]
        public ContactInfo ContactPerson { get; set; }

        /// <summary>
        /// Реквізити осіб-фігурантів анкети
        /// </summary>
        public List<GenericPersonInfo> MentionedIdentities { get; set; }

        /// <summary>
        /// Зв'язки між фігурантами анкети
        /// </summary>
        public List<PersonsAssociation> PersonsLinks { get; set; }

        public string SuggestSaveAsFileName()
        {
            return "regLicDod2IstUchYO";
        }
    }
}
