using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using BGU.DRPL.SignificantOwnership.Core.Spares.Dict;
using System.ComponentModel;
using Evolvex.Utility.Core.ComponentModelEx;
using BGU.DRPL.SignificantOwnership.Core.Spares.Data;

namespace BGU.DRPL.SignificantOwnership.Core.Questionnaires
{
    /// <summary>
    /// АНКЕТА членів виконавчого органу та наглядової (спостережної) ради юридичної особи
    /// Додаток 3 до Положення про порядок реєстрації та ліцензування банків, відкриття відокремлених підрозділів
    /// file                                  : f364524n1223.doc
    /// Рівень складності                     : 9
    /// (оціночний, шкала від 1 до 10)
    /// Пріоритетність                        : Hi  (Легенда: Hi - Висока, Lo - Низька, Mid - Середня, Hold - Поки що притримати)
    /// Подавач анкети                        : LP (Легенда: LP - юр.особа, PP - фіз.особа, BK - банк)
    /// Чи заповнюватиметься он-лайн          : Так
    /// Первинну розробку структури завершено : Ні
    /// Структуру фіналізовано                : Ні
    /// (=остаточно узгоджено 
    /// з бізнес-користувачами)
    /// </summary>
    public class RegLicAppx3MemberCandidateAppl : IQuestionnaire
    {
        #region Original fields
        /// <summary>
        /// Стосовно участі в ___________________________________________________________________
        /// (повне офіційне найменування банку)
        /// ___________________________________________________________________________________
        /// (найменування юридичної особи)
        /// </summary>
        public BankInfo BankRef { get; set; }
        
        /// <summary>
        /// 1. Інформація про особу
        /// 1.1. _______________________________________________________________________________.
        ///         (прізвище, ім'я, по батькові, посада в юридичній особі)
        /// 1.2. Паспортні дані _________________________________________________________________.
        ///   (серія, номер, дата видачі, ким виданий)
        /// 1.3. Громадянство __________________________________________________________________.
        /// (країна, дата прийняття громадянства, якщо воно змінювалося)
        /// 1.4. Адреса постійного місця проживання ______________________________________________.
        /// 1.5. Реєстраційний номер облікової картки платника податків або серія та номер паспорта (для фізичних осіб, які через свої релігійні переконання відмовляються від прийняття реєстраційного
        /// номера облікової картки платника податків та повідомили про це відповідний контролюючий орган і мають відмітку у  паспорті) __________________________________________________________________________________.
        /// </summary>
        [DisplayName("Кандидат")]
        [Description("Реквізити фізособи-кандидата на посаду...")]
        [Required]
        public GenericPersonID Candidate { get; set; }
        
        /// <summary>
        /// 1.6. Займані посади за останні п'ять років _______________________________________________
        /// ___________________________________________________________________________________
        /// (найменування юридичної особи, найменування посади;  період перебування на посаді з _____ до _____;
        /// __________________________________________________________________________________.
        /// причина звільнення; якщо трудовий стаж переривався, то слід зазначити причину)
        /// </summary>
        [Required]
        public List<EmploymentRecordInfo> Last5YrsWorkExperience { get; set; }

        /// <summary>
        /// 1.7. Останнє місце роботи, номер телефону роботодавця _________________________________.
        /// </summary>
        [DisplayName("Місце роботи")]
        [Description("9. Місце роботи і посада на дату заповнення анкети ")]
        [Required]
        public EmploymentRecordInfo LastEmploymentRecord { get; set; }

        /// <summary>
        /// 1.8. Освіта та професійна кваліфікація _________________________________________________
        ///                                        (науковий ступінь,
        /// __________________________________________________________________________________.
        /// професійна ліцензія, номер, дата видачі диплома, ким виданий, спеціальність і кваліфікація)
        /// </summary>
        [Required]
        public List<EducationRecordInfo> Education { get; set; }

        /// <summary>
        /// Покриває п.1.8 (у частині проф.ліцензій)
        /// </summary>
        [Required]
        public bool HasProfessionalLicenses { get; set; }
        /// <summary>
        /// Поле необов'язкове - якщо є професійні ліцензії ( HasProfessionalLicenses == true )
        /// Покриває п.1.8 (у частині проф.ліцензій)
        /// </summary>
        public List<ProfessionLicenseInfo> ProfessionalLicenses {get;set;}

        [Required]
        public bool IsAppyingForSignificantOwnership {get;set;}
        /// <summary>
        /// 1.9. Розмір участі в юридичній особі, яка має намір набути або збільшити істотну участь у банку-емітенті,*
        /// ___________________________________________________________________.
        /// 
        /// * Заповнюється власниками істотної участі в банку або особами, які мають намір набути істотну участь у банку.
        /// ----
        /// Вимагати, якщо IsAppyingForSignificantOwnership == true
        /// </summary>
        public List<OwnershipStructure> OwnershipStakeWithLPAcquiree {get;set;}

        /// <summary>
        /// 1.10. Розмір отриманих  доходів за останній звітний період (рік)*  
        /// __________________________________________________________________________________.
        /// 
        /// * Заповнюється власниками істотної участі в банку або особами, які мають намір набути істотну участь у банку.
        /// </summary>
        [Required]
        public CurrencyAmount LastYearIncome {get;set;}


        /// <summary>
        /// 2. Відносини власності з банком-емітентом
        /// 2.1. Чи є Ви учасником банку-емітента? _______________________________________________:
        /// (так, ні)
        /// </summary>
        public bool IsIssuerBankStakeholder { get; set; }

        /// <summary>
        /// а) пряме володіння - ____ відсотків статутного капіталу банку, що  становить ________________ 
        ///                                                                                (кількість)
        /// акцій (паїв),  загальною номінальною вартістю ______________ гривень;
        /// </summary>
        public SharesAcquisitionInfo DirectOwnershipWithBankSummary { get; set; }

        /// б) опосередковане володіння - ______ відсотків 
        public SharesAcquisitionInfo ImplicitOwnershipWithBankSummary { get; set; }
        /// через _______________________
        /// __________________________________________________________________________________.
        /// (найменування учасника банку та розмір його прямого володіння в банку)
        
        public List<OwnershipStructure> ImplicitOwnershipWithBank { get; set; }
        /// 2.2. Чи маєте Ви (як фізична особа) намір збільшити частку в статутному капіталі банку-емітента? _________________________________________________________________________.
        public bool HasIntentToIncreaseEquityShareAsPhysPerson { get; set; }

        /// <summary>
        /// 2.3. Чи є Ви пов'язаною з банком-емітентом особою? ____________________________________
        /// __________________________________________________________________________________.
        ///                                                 зазначається відповідно до статті 52 Закону України "Про банки і банківську діяльність")
        /// ---------------
        /// Якщо "так", то треба розкрити природу зв'язку в полі PersonsLinks
        /// </summary>
        public bool IsAssociatedPersonWithBank { get; set; }

        /// 3. Інші питання

        
        /// <summary>
        /// 3.1. Чи притягувалися Ви до кримінальної відповідальності? ______________________________
        /// </summary>
        [Required]
        public bool WasCriminallyProsecuted { get; set; }

        /// <summary>
        /// __________________________________________________________________________________.
        /// (якщо так, то зазначити де і коли, за якою статтею/статтями Кримінального кодексу України)
        /// 3.2. Чи маєте Ви судимість не погашену,  не зняту в установленому законодавством порядку? 
        /// </summary>
        [Required]
        public bool HasOutstandingSentencesToServe { get; set; }

        /// <summary>
        /// 3.3. Чи притягувалися Ви до відповідальності за порушення антимонопольного, податкового, 
        /// банківського, валютного законодавства, правил діяльності на ринку цінних паперів тощо? _____
        /// </summary>
        public bool HadIndustrySpecificBreaches { get; set; }
        
        /// <summary>
        /// Розшифровка пп.3.1, 3.2. і 3.3.
        /// ___________________________________________________________________________________
        /// __________________________________________________________________________________.
        /// (якщо так, то зазначити детальну інформацію)
        /// __________________________________________________________________________________.
        /// (коли вчинено порушення, зміст порушення, які накладені санкції)
        /// </summary>
        public List<BreachOfLawRecordInfo> BreachesOfLaw { get; set; }


        /// <summary>
        /// 3.4. Чи маєте Ви невиконані майнові (фінансові) зобов'язання  перед іншими особами? 
        /// </summary>
        [Required]
        public bool HasMiscNonRepaidDebts { get; set; }

        /// <summary>
        /// ___________________________________________________________________________________
        /// (якщо так, то зазначити, які саме зобов'язання,
        /// ___________________________________________________________________________________
        ///  у якому розмірі, перед якою особою та з яких причин не були виконані,
        /// __________________________________________________________________________________.
        ///  а також подальші плани щодо виконання/невиконання цих зобов'язань)
        /// </summary>
        [Required]
        public List<IndebtnessInfo> MiscNonRepaidDebts { get; set; }


 
        
        /// <summary>
        /// 3.5. Стверджую, що я належним чином виконую вимоги законодавства України з питань 
        /// запобігання та протидії легалізації (відмиванню) доходів, одержаних злочинним шляхом, 
        /// або фінансуванню тероризму.
        /// </summary>
        public bool IsAMLLegislationKept { get; set; }

        /// <summary>
        /// Я, ________________________________________________________________________________,
        ///      (прізвище, ім'я, по батькові)
        /// стверджую, що інформація, надана в анкеті, є правдивою і повною, та не заперечую проти перевірки 
        /// Національним банком України достовірності поданих документів і персональних даних, що в них містяться.
        /// </summary>
        [Required]
        public bool IsApplicationInfoAccurateAndTrue { get; set; }


        /// У разі будь-яких змін в інформації, що зазначена в цій анкеті, зобов'язуюся повідомити про них Національний банк України протягом 10-ти днів з дня їх виникнення.
        [Required]
        public bool AmObligingToKeepUp2DateWithin10Days { get; set; }


        /// <summary>
        /// _______________________
        /// (дата підписання анкети)
        /// _____________________
        /// (підпис фізичної особи,
        /// засвідчений нотаріально)	
        /// _______________________
        /// (ініціали та прізвище
        ///    фізичної особи
        ///  друкованими літерами)
        /// </summary>
        [DisplayName("Підписант")]
        [Description("Відомості по особу, що підписала анкету")]
        [Required]
        public SignatoryInfo Signatory { get; set; }
        #endregion



        public string SuggestSaveAsFileName()
        {
            return "regLicDod3KandUChl";
        }
    }
}
